edjli2005/pegasusdrone/boostxl_sensors_sensorGui_msp432p401r_MSP_EXP432P401R_nortos_ccs/src/main.c
    if (status & GPIO_PIN1) // if button 1.1 is pressed
    {
        uint32_t variable = CS_getSMCLK();
        printf("\nSMCLK: %d\n",variable);
        printf("p1\n");
        // TimerA1.1 pin 7.7 Motor 1 CCW
        throttleCCW = getNewThrottle1();
        if (throttleCCW == 0)
        {
            throttleCCW = previousThrottleCCW;
        }
        throttleMotor1(throttleCCW);
        previousThrottleCCW = throttleCCW;

        // TimerA1.2 pin 7.6 Motor 2 CCW
        throttleCCW = getNewThrottle2();
        if (throttleCCW == 0)
        {
            throttleCCW = previousThrottleCCW;
        }
        throttleMotor2(throttleCCW);
        previousThrottleCCW = throttleCCW;

        // Toggle P1.0 output - Button Press debug purposes
        MAP_GPIO_toggleOutputOnPin(GPIO_PORT_P1,GPIO_PIN0);
    }

    if (status & GPIO_PIN4) // if button 1.4 is pressed
    {
        // TimerA1.3 pin 7.5 Motor 3 CW
        throttleCW = getNewThrottle3();
        if (throttleCW == 0)
        {
            throttleCW = previousThrottleCW;
        }
        throttleMotor3(throttleCW);
        previousThrottleCW = throttleCW;

        // TimerA1.4 pin 7.4 Motor 4 CW
        throttleCW = getNewThrottle4();
        if (throttleCW == 0)
        {
            throttleCW = previousThrottleCW;
        }
        throttleMotor1(throttleCW);
        previousThrottleCW = throttleCW;

        // Toggle P1.0 output - Button Press debug purposes
        MAP_GPIO_toggleOutputOnPin(GPIO_PORT_P1,GPIO_PIN0);
    }

    for(i=5000; i>0; i--) // debounce
        MAP_GPIO_clearInterruptFlag(GPIO_PORT_P1, status);





//		MAP_GPIO_clearInterruptFlag(GPIO_PORT_P1, status);

#ifdef USE_LPM
	MAP_Interrupt_disableSleepOnIsrExit();
#endif
}

/***********************************************************
  Function: PORT5_IRQHandler
 */
void PORT5_IRQHandler(void)
{
	uint32_t status;

	status = MAP_GPIO_getEnabledInterruptStatus(GPIO_PORT_P5);

	MAP_GPIO_disableInterrupt(GPIO_PORT_P5, GPIO_PIN2);
	MAP_Interrupt_disableInterrupt(INT_PORT5);

	if(status & GPIO_PIN2)
	{
	}

	/* Delay for switch debounce */
	MAP_GPIO_clearInterruptFlag(GPIO_PORT_P5, status);

#ifdef USE_LPM
	MAP_Interrupt_disableSleepOnIsrExit();
#endif
}

/***********************************************************
  Function: _system_pre_init
 */
int _system_pre_init(void)
{
	// stop WDT
	MAP_WDT_A_holdTimer();                        // Hold watchdog timer

	// Perform C/C++ global data initialization
	return 1;
}
